{"cells":[{"cell_type":"code","execution_count":null,"id":"248caa0a","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":49313,"status":"ok","timestamp":1713058050822,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"248caa0a","outputId":"c8048d4b-fac5-472c-9423-599b7fd1a568"},"outputs":[{"name":"stdout","output_type":"stream","text":["Collecting neo4j\n","  Downloading neo4j-5.19.0.tar.gz (202 kB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m203.0/203.0 kB\u001b[0m \u001b[31m2.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25h  Installing build dependencies ... \u001b[?25l\u001b[?25hdone\n","  Getting requirements to build wheel ... \u001b[?25l\u001b[?25hdone\n","  Installing backend dependencies ... \u001b[?25l\u001b[?25hdone\n","  Preparing metadata (pyproject.toml) ... \u001b[?25l\u001b[?25hdone\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2023.4)\n","Building wheels for collected packages: neo4j\n","  Building wheel for neo4j (pyproject.toml) ... \u001b[?25l\u001b[?25hdone\n","  Created wheel for neo4j: filename=neo4j-5.19.0-py3-none-any.whl size=280741 sha256=efdd8bb3ab7eebb356842325632986ebc0c61dff9d24f36eb02c0dc218fc1837\n","  Stored in directory: /root/.cache/pip/wheels/30/db/9b/2cfde1fa33145219c0322f299b604daf5aba2ed443a7ed5f07\n","Successfully built neo4j\n","Installing collected packages: neo4j\n","Successfully installed neo4j-5.19.0\n","Collecting tomlkit\n","  Downloading tomlkit-0.12.4-py3-none-any.whl (37 kB)\n","Installing collected packages: tomlkit\n","Successfully installed tomlkit-0.12.4\n","Requirement already satisfied: neo4j in /usr/local/lib/python3.10/dist-packages (5.19.0)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2023.4)\n","Collecting py2neo\n","  Downloading py2neo-2021.2.4-py2.py3-none-any.whl (177 kB)\n","\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m177.2/177.2 kB\u001b[0m \u001b[31m3.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hRequirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from py2neo) (2024.2.2)\n","Collecting interchange~=2021.0.4 (from py2neo)\n","  Downloading interchange-2021.0.4-py2.py3-none-any.whl (28 kB)\n","Collecting monotonic (from py2neo)\n","  Downloading monotonic-1.6-py2.py3-none-any.whl (8.2 kB)\n","Requirement already satisfied: packaging in /usr/local/lib/python3.10/dist-packages (from py2neo) (24.0)\n","Collecting pansi\u003e=2020.7.3 (from py2neo)\n","  Downloading pansi-2020.7.3-py2.py3-none-any.whl (10 kB)\n","Requirement already satisfied: pygments\u003e=2.0.0 in /usr/local/lib/python3.10/dist-packages (from py2neo) (2.16.1)\n","Requirement already satisfied: six\u003e=1.15.0 in /usr/local/lib/python3.10/dist-packages (from py2neo) (1.16.0)\n","Requirement already satisfied: urllib3 in /usr/local/lib/python3.10/dist-packages (from py2neo) (2.0.7)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from interchange~=2021.0.4-\u003epy2neo) (2023.4)\n","Installing collected packages: monotonic, pansi, interchange, py2neo\n","Successfully installed interchange-2021.0.4 monotonic-1.6 pansi-2020.7.3 py2neo-2021.2.4\n"]}],"source":["!pip install neo4j\n","!pip3 install tomlkit\n","!pip3 install -U neo4j\n","!pip install py2neo"]},{"cell_type":"code","execution_count":null,"id":"gYylg-GaV0de","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":982,"status":"ok","timestamp":1713058082949,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"gYylg-GaV0de","outputId":"c5d6f5f9-0065-4aa2-89de-5faa66929cf3"},"outputs":[{"name":"stdout","output_type":"stream","text":["Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount(\"/content/drive\", force_remount=True).\n"]}],"source":["from google.colab import drive\n","drive.mount('/content/drive')"]},{"cell_type":"code","execution_count":null,"id":"f81XcFA2YVDc","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":6262,"status":"ok","timestamp":1713058336875,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"f81XcFA2YVDc","outputId":"69352847-1426-46f4-b86d-43db9540b941"},"outputs":[{"name":"stderr","output_type":"stream","text":["\u003cipython-input-10-c1d2bfdfbecd\u003e:5: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.\n","  df = pd.read_csv('/content/combined_data.csv')\n"]},{"name":"stdout","output_type":"stream","text":["   rating                                              title parent_asin  \\\n","0     5.0  Tyger Auto T1 Soft Roll Up Truck Bed Tonneau C...  B0BV88374L   \n","1     5.0  Tailgate Insert Letters Compatible with F150 R...  B0B2WGS5ND   \n","2     1.0  uxcell Adhesive 3\" Round Side Rearview Blind S...  B00A0GV20Q   \n","3     5.0  Crevelle Custom Fits 2009-2020 Nissan 370Z / 3...  B08C27WWVG   \n","4     5.0  Pre-Painted Trunk Spoiler Compatible with 2009...  B0719J5ZNY   \n","\n","                        user_id  average_rating  rating_number  price  \\\n","0  AHMUTK5MAIDB7NQZQYH5NIOPT6BQ             4.8         5239.0  207.0   \n","1  AFE337D2J37YRU5U6MVTVKNDKWDA             5.0            1.0    NaN   \n","2  AGMVX6M2O2J7L63ATNZA2KBWHIAQ             3.7            8.0    NaN   \n","3  AHQOKY3AQJG5WK4QGPCIVRA2UEBQ             4.4           65.0  95.95   \n","4  AEZBUG7X75XAZ6MSPQ43QWY2WBBQ             4.6           28.0    NaN   \n","\n","              store                                         categories  \n","0        Tyger Auto  Automotive, Exterior Accessories, Truck Bed \u0026 ...  \n","1             FOGER          Automotive, Exterior Accessories, Emblems  \n","2            uxcell  Automotive, Replacement Parts, Body \u0026 Trim, Bo...  \n","3          Crevelle  Automotive, Exterior Accessories, Covers, Full...  \n","4  IKON MOTORSPORTS   Automotive, Replacement Parts, Body \u0026 Trim, Body  \n"]}],"source":["import pandas as pd\n","import numpy as np\n","from py2neo import Graph, Node, Relationship\n","\n","df = pd.read_csv('/content/combined_data.csv')\n","print(df.head())"]},{"cell_type":"code","execution_count":24,"id":"bERCAeGHjpoq","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":857,"status":"ok","timestamp":1713060115806,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"bERCAeGHjpoq","outputId":"55459b31-5ecf-43e8-84f2-02566ecce52b"},"outputs":[{"name":"stdout","output_type":"stream","text":["   rating                                              title parent_asin  \\\n","0     5.0  Tyger Auto T1 Soft Roll Up Truck Bed Tonneau C...  B0BV88374L   \n","1     5.0  Tailgate Insert Letters Compatible with F150 R...  B0B2WGS5ND   \n","2     1.0  uxcell Adhesive 3\" Round Side Rearview Blind S...  B00A0GV20Q   \n","3     5.0  Crevelle Custom Fits 2009-2020 Nissan 370Z / 3...  B08C27WWVG   \n","4     5.0  Pre-Painted Trunk Spoiler Compatible with 2009...  B0719J5ZNY   \n","\n","                        user_id  average_rating  rating_number   price  \\\n","0  AHMUTK5MAIDB7NQZQYH5NIOPT6BQ             4.8         5239.0  207.00   \n","1  AFE337D2J37YRU5U6MVTVKNDKWDA             5.0            1.0    0.00   \n","2  AGMVX6M2O2J7L63ATNZA2KBWHIAQ             3.7            8.0    0.00   \n","3  AHQOKY3AQJG5WK4QGPCIVRA2UEBQ             4.4           65.0   95.95   \n","4  AEZBUG7X75XAZ6MSPQ43QWY2WBBQ             4.6           28.0    0.00   \n","\n","              store                                         categories  \n","0        Tyger Auto  Automotive, Exterior Accessories, Truck Bed \u0026 ...  \n","1             FOGER          Automotive, Exterior Accessories, Emblems  \n","2            uxcell  Automotive, Replacement Parts, Body \u0026 Trim, Bo...  \n","3          Crevelle  Automotive, Exterior Accessories, Covers, Full...  \n","4  IKON MOTORSPORTS   Automotive, Replacement Parts, Body \u0026 Trim, Body  \n"]}],"source":["#DATA CLEANING\n","\n","# Convert 'price' to numeric, converting errors to NaN\n","df['price'] = pd.to_numeric(df['price'], errors='coerce')\n","\n","# Fill NaN values in 'price' and other necessary columns\n","df.fillna({\n","    'rating': 0,\n","    'title': 'Unknown',\n","    'parent_asin': 'Unknown',\n","    'user_id': 'Unknown',\n","    'average_rating': 0,\n","    'rating_number': 0,\n","    'price': 0,  # Default value for NaN prices\n","    'store': 'Unknown',\n","    'categories': 'Unknown'\n","}, inplace=True)\n","\n","print(df.head())\n"]},{"cell_type":"code","execution_count":23,"id":"GyHCPZF5VMX7","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":152,"status":"ok","timestamp":1713059975726,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"GyHCPZF5VMX7","outputId":"28eca1ed-eb96-4f39-9f4e-20353396042a"},"outputs":[{"name":"stdout","output_type":"stream","text":["Index(['rating', 'title', 'parent_asin', 'user_id', 'average_rating',\n","       'rating_number', 'price', 'store', 'categories'],\n","      dtype='object')\n"]}],"source":["print(df.columns)\n"]},{"cell_type":"code","execution_count":null,"id":"FLxJJBEMrj7T","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":130,"status":"ok","timestamp":1713058342162,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"FLxJJBEMrj7T","outputId":"784c5b64-b72c-4ba8-da54-6512dbc53749"},"outputs":[{"name":"stderr","output_type":"stream","text":["ERROR:neo4j.pool:Unable to retrieve routing information\n"]},{"name":"stdout","output_type":"stream","text":["Failed to connect to Neo4j: Unable to retrieve routing information\n"]}],"source":["# V1 CONNECT TO NEO4J\n","from neo4j import GraphDatabase\n","\n","\n","username = \"neo4j\"\n","password = \"apan5400\"\n","uri = \"neo4j:////8.tcp.ngrok.io:17322 -\u003e localhost:7687 \"\n","\n","driver = GraphDatabase.driver(uri, auth=(username, password))\n","session = driver.session()\n","\n","graph = Graph(uri, auth=(username, password))\n","\n","def test_connection():\n","    try:\n","        with driver.session() as session:\n","            result = session.run(\"RETURN 'Successfully connected to Neo4j!' AS greeting\")\n","            for record in result:\n","                print(record['greeting'])\n","    except Exception as e:\n","        print(f\"Failed to connect to Neo4j: {e}\")\n","    finally:\n","        driver.close()\n","\n","# Test the connection\n","test_connection()\n","\n"]},{"cell_type":"code","execution_count":null,"id":"y8QOC0zphM_l","metadata":{"colab":{"background_save":true},"id":"y8QOC0zphM_l"},"outputs":[{"ename":"NameError","evalue":"name 'DatabaseError' is not defined","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mBrokenWireError\u001b[0m                           Traceback (most recent call last)","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36mread_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    155\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 156\u001b[0;31m                 \u001b[0mhi\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlo\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwire\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    157\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mWireError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/wiring.py\u001b[0m in \u001b[0;36mread\u001b[0;34m(self, n)\u001b[0m\n\u001b[1;32m    127\u001b[0m                 \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 128\u001b[0;31m                     self.__mark_broken(\"Network read incomplete \"\n\u001b[0m\u001b[1;32m    129\u001b[0m                                        \u001b[0;34m\"(received %d of %d bytes)\"\u001b[0m \u001b[0;34m%\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/wiring.py\u001b[0m in \u001b[0;36m__mark_broken\u001b[0;34m(self, message)\u001b[0m\n\u001b[1;32m    219\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__broken\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 220\u001b[0;31m         raise BrokenWireError(message, idle_time=idle_time,\n\u001b[0m\u001b[1;32m    221\u001b[0m                               \u001b[0mbytes_sent\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__bytes_sent\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mBrokenWireError\u001b[0m: Network read incomplete (received 0 of 2 bytes) after 19.6s idle (3478066 bytes sent, 958536 bytes received)","\nThe above exception was the direct cause of the following exception:\n","\u001b[0;31mConnectionBroken\u001b[0m                          Traceback (most recent call last)","\u001b[0;32m\u003cipython-input-26-289cd3ffe4bc\u003e\u001b[0m in \u001b[0;36mwrite_data_to_neo4j\u001b[0;34m(df, graph)\u001b[0m\n\u001b[1;32m      7\u001b[0m         \u001b[0;32mfor\u001b[0m \u001b[0mindex\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mrow\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0miterrows\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----\u003e 8\u001b[0;31m             graph.run(\"\"\"\n\u001b[0m\u001b[1;32m      9\u001b[0m                 \u001b[0mMERGE\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mproduct\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0mProduct\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0masin\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m \u001b[0m\u001b[0;31m$\u001b[0m\u001b[0masin\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtitle\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m \u001b[0m\u001b[0;31m$\u001b[0m\u001b[0mtitle\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mprice\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m \u001b[0m\u001b[0;31m$\u001b[0m\u001b[0mprice\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0maverage_rating\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;31m \u001b[0m\u001b[0;31m$\u001b[0m\u001b[0maverage_rating\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    404\u001b[0m         \"\"\"\n\u001b[0;32m--\u003e 405\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    406\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    991\u001b[0m                                                   readonly=self.readonly)\n\u001b[0;32m--\u003e 992\u001b[0;31m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connector\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresult\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m-\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    993\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mCursor\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresult\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhydrant\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/__init__.py\u001b[0m in \u001b[0;36mpull\u001b[0;34m(self, result, n)\u001b[0m\n\u001b[1;32m   1433\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-\u003e 1434\u001b[0;31m             \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresult\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1435\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mConnectionUnavailable\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mConnectionBroken\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36mpull\u001b[0;34m(self, result, n, capacity)\u001b[0m\n\u001b[1;32m    994\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 995\u001b[0;31m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_sync\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    996\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mBrokenWireError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36m_sync\u001b[0;34m(self, *responses)\u001b[0m\n\u001b[1;32m    798\u001b[0m         \u001b[0;32mfor\u001b[0m \u001b[0mresponse\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mresponses\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 799\u001b[0;31m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_wait\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    800\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36m_wait\u001b[0;34m(self, response)\u001b[0m\n\u001b[1;32m    793\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdone\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 794\u001b[0;31m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    795\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    768\u001b[0m         \"\"\"\n\u001b[0;32m--\u003e 769\u001b[0;31m         \u001b[0mtag\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfields\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    770\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtag\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0x70\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36mread_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    695\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mread_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 696\u001b[0;31m         \u001b[0mtag\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfields\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_reader\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    697\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtag\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0x71\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/py2neo/client/bolt.py\u001b[0m in \u001b[0;36mread_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    157\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mWireError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 158\u001b[0;31m                 \u001b[0mraise_from\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mConnectionBroken\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Failed to read message\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    159\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/six.py\u001b[0m in \u001b[0;36mraise_from\u001b[0;34m(value, from_value)\u001b[0m\n","\u001b[0;31mConnectionBroken\u001b[0m: Failed to read message","\nDuring handling of the above exception, another exception occurred:\n","\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)","\u001b[0;32m\u003cipython-input-26-289cd3ffe4bc\u003e\u001b[0m in \u001b[0;36m\u003ccell line: 28\u003e\u001b[0;34m()\u001b[0m\n\u001b[1;32m     26\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     27\u001b[0m \u001b[0;31m# Call the function\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 28\u001b[0;31m \u001b[0mwrite_data_to_neo4j\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     29\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m\u003cipython-input-26-289cd3ffe4bc\u003e\u001b[0m in \u001b[0;36mwrite_data_to_neo4j\u001b[0;34m(df, graph)\u001b[0m\n\u001b[1;32m     19\u001b[0m             })\n\u001b[1;32m     20\u001b[0m         \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcommit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 21\u001b[0;31m     \u001b[0;32mexcept\u001b[0m \u001b[0mDatabaseError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     22\u001b[0m         \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Database error occurred:\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     23\u001b[0m         \u001b[0mtx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrollback\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m  \u001b[0;31m# Rollback the transaction if any error occurs\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mNameError\u001b[0m: name 'DatabaseError' is not defined"]}],"source":["from py2neo import Graph\n","\n","graph = Graph(\"neo4j://8.tcp.ngrok.io:17322\", auth=(\"neo4j\", \"apan5400\"))\n","\n","# Function to write DataFrame to Neo4j using py2neo\n","def write_data_to_neo4j(df, graph):\n","    # Iterate through DataFrame rows\n","    for index, row in df.iterrows():\n","        graph.run(\"\"\"\n","            MERGE (product:Product {asin: $asin, title: $title, price: $price, average_rating: $average_rating})\n","            MERGE (customer:Customer {id: $user_id})\n","            MERGE (customer)-[purchase:PURCHASED {rating: $rating}]-\u003e(product)\n","        \"\"\", parameters={\n","            'asin': row['parent_asin'],\n","            'title': row['title'],\n","            'price': row['price'],\n","            'average_rating': row['average_rating'],\n","            'user_id': row['user_id'],\n","            'rating': row['rating']\n","        })\n","\n","# Execute the function\n","write_data_to_neo4j(df, graph)\n","\n","# Assuming GDS plugin is installed and proper graph projection has been created\n","centrality_query = \"\"\"\n","CALL gds.graph.create(\n","  'salesGraph',\n","  ['Product', 'Customer'],\n","  ['PURCHASED']\n",")\n","\n","CALL gds.betweenness.stream('salesGraph')\n","YIELD nodeId, score\n","MATCH (n) WHERE id(n) = nodeId\n","SET n.betweenness = score\n","\n","CALL gds.pageRank.stream('salesGraph')\n","YIELD nodeId, score\n","MATCH (n) WHERE id(n) = nodeId\n","SET n.pageRank = score\n","\n","CALL gds.louvain.stream('salesGraph')\n","YIELD nodeId, communityId\n","MATCH (n) WHERE id(n) = nodeId\n","SET n.communityId = communityId\n","\"\"\"\n","graph.run(centrality_query)\n","\n","# Retrieve and display the top products based on PageRank\n","top_products_query = \"\"\"\n","MATCH (p:Product)\n","RETURN p.asin AS ProductASIN, p.pageRank AS PageRank\n","ORDER BY PageRank DESC\n","LIMIT 10\n","\"\"\"\n","top_products = graph.run(top_products_query).to_data_frame()\n","\n","print(\"Top Products Based on PageRank:\")\n","print(top_products)"]},{"cell_type":"code","execution_count":null,"id":"FaBkbudxPXNA","metadata":{"executionInfo":{"elapsed":4,"status":"aborted","timestamp":1713059923745,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"FaBkbudxPXNA"},"outputs":[],"source":["#V2\n","from neo4j import GraphDatabase\n","\n","uri = \"neo4j://.tcp.ngrok.io:17322 -\u003e localhost:7687\"\n","username = \"neo4j\"\n","password = \"apan5400\"\n","\n","driver = GraphDatabase.driver(uri, auth=(username, password))\n","\n","def test_connection():\n","    try:\n","        with driver.session() as session:\n","            result = session.run(\"RETURN 'Successfully connected to Neo4j!' AS greeting\")\n","            for record in result:\n","                print(record['greeting'])\n","    except Exception as e:\n","        print(f\"Failed to connect to Neo4j: {e}\")\n","    finally:\n","        driver.close()\n","\n","# Test the connection\n","test_connection()"]},{"cell_type":"code","execution_count":null,"id":"OBSIcEL-ojRR","metadata":{"id":"OBSIcEL-ojRR"},"outputs":[],"source":["def execute_query(driver, query, parameters=None):\n","    with driver.session() as session:\n","        # Run the Cypher query\n","        result = session.run(query, parameters)\n","        return result"]},{"cell_type":"code","execution_count":null,"id":"g4Qc8dIerf8d","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":44938,"status":"ok","timestamp":1713041826866,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"g4Qc8dIerf8d","outputId":"00d3c25b-ad31-4486-cb23-0679123c4793"},"outputs":[{"name":"stderr","output_type":"stream","text":["ERROR:neo4j.io:Failed to write data to connection ResolvedIPv4Address(('3.134.125.175', 18369)) (ResolvedIPv4Address(('3.134.125.175', 18369)))\n","ERROR:neo4j.io:Failed to write data to connection IPv4Address(('0.tcp.ngrok.io', 18369)) (ResolvedIPv4Address(('3.134.125.175', 18369)))\n","ERROR:neo4j.io:Failed to write data to connection ResolvedIPv4Address(('3.14.182.203', 18369)) (ResolvedIPv4Address(('3.14.182.203', 18369)))\n","ERROR:neo4j.io:Failed to write data to connection IPv4Address(('0.tcp.ngrok.io', 18369)) (ResolvedIPv4Address(('3.14.182.203', 18369)))\n","\u003cipython-input-40-f231172bffca\u003e:22: DeprecationWarning: write_transaction has been renamed to execute_write\n","  result = session.write_transaction(_execute_tx, query, parameters)\n","ERROR:neo4j.pool:Unable to retrieve routing information\n","WARNING:neo4j.pool:Transaction failed and will be retried in 1.0854455119339492s (Unable to retrieve routing information)\n","ERROR:neo4j.pool:Unable to retrieve routing information\n","WARNING:neo4j.pool:Transaction failed and will be retried in 1.7205233764853736s (Unable to retrieve routing information)\n","ERROR:neo4j.pool:Unable to retrieve routing information\n","WARNING:neo4j.pool:Transaction failed and will be retried in 4.137058787832422s (Unable to retrieve routing information)\n","ERROR:neo4j.pool:Unable to retrieve routing information\n","WARNING:neo4j.pool:Transaction failed and will be retried in 9.070683249835401s (Unable to retrieve routing information)\n","ERROR:neo4j.pool:Unable to retrieve routing information\n","WARNING:neo4j.pool:Transaction failed and will be retried in 14.063553353235555s (Unable to retrieve routing information)\n","ERROR:neo4j.pool:Unable to retrieve routing information\n"]},{"name":"stdout","output_type":"stream","text":["An error occurred: Unable to retrieve routing information\n"]}],"source":["#V1\n","from neo4j import GraphDatabase\n","\n","cypher_query = '''\n","UNWIND $products AS product\n","MERGE (p:Product {asin: product.parent_asin})\n","  ON CREATE SET p.title = product.title, p.price = product.price\n","MERGE (u:User {id: product.user_id})\n","MERGE (u)-[:PURCHASED {rating: product.rating}]-\u003e(p)\n","MERGE (s:Store {name: product.store})\n","MERGE (p)-[:SOLD_BY]-\u003e(s)\n","WITH product, p\n","UNWIND product.categories AS category\n","MERGE (c:Category {name: category})\n","MERGE (p)-[:BELONGS_TO]-\u003e(c)\n","'''\n","\n","def execute_query(driver, query, parameters=None):\n","    # Open a session with the database\n","    with driver.session() as session:\n","        # Execute the query in a transaction\n","        result = session.write_transaction(_execute_tx, query, parameters)\n","        return result\n","\n","def _execute_tx(tx, query, parameters):\n","    # Run the query within the transaction\n","    result = tx.run(query, parameters)\n","    return result.summary().counters\n","\n","# Main execution block\n","if __name__ == \"__main__\":\n","    # Assuming you have a way to create a Neo4j driver\n","    driver = GraphDatabase.driver(\"neo4j://0.tcp.ngrok.io:18369 -\u003e localhost:7687\", auth=(\"neo4j\", \"apan5400\"))\n","\n","    try:\n","        products = df.to_dict('records')\n","        execute_query(driver, cypher_query, parameters={'products': products})\n","        print(\"Graph creation in Neo4j is complete.\")\n","    except Exception as e:\n","        print(f\"An error occurred: {str(e)}\")\n","    finally:\n","        # Ensure the driver is closed properly\n","        driver.close()\n"]},{"cell_type":"code","execution_count":null,"id":"dH7HoteKSo3P","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":421},"executionInfo":{"elapsed":310026,"status":"error","timestamp":1713042838459,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"dH7HoteKSo3P","outputId":"4c7d37bd-9184-488f-e03b-f63cf0cdd72e"},"outputs":[{"name":"stderr","output_type":"stream","text":["\u003cipython-input-62-dc6aeec45bb8\u003e:4: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n","  with driver.session() as session:\n"]},{"ename":"KeyboardInterrupt","evalue":"","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)","\u001b[0;32m\u003cipython-input-62-dc6aeec45bb8\u003e\u001b[0m in \u001b[0;36m\u003ccell line: 56\u003e\u001b[0;34m()\u001b[0m\n\u001b[1;32m     54\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     55\u001b[0m \u001b[0;31m# Execute the graph creation\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 56\u001b[0;31m \u001b[0mcreate_graph\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdriver\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     57\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     58\u001b[0m \u001b[0;31m# Close the driver connection when done\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m\u003cipython-input-62-dc6aeec45bb8\u003e\u001b[0m in \u001b[0;36mcreate_graph\u001b[0;34m(driver, df)\u001b[0m\n\u001b[1;32m     30\u001b[0m             \u001b[0mcategories\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mrow\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'categories'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msplit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m', '\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     31\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0mcategory_name\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mcategories\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 32\u001b[0;31m                 session.run(\n\u001b[0m\u001b[1;32m     33\u001b[0m                     \u001b[0;34m\"MERGE (c:Category {name: $name})\"\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     34\u001b[0m                     \u001b[0;34m{\u001b[0m\u001b[0;34m'name'\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mcategory_name\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/work/session.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[1;32m    311\u001b[0m         \u001b[0mbookmarks\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_get_bookmarks\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    312\u001b[0m         \u001b[0mparameters\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mdict\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mparameters\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 313\u001b[0;31m         self._auto_result._run(\n\u001b[0m\u001b[1;32m    314\u001b[0m             \u001b[0mquery\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    315\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mimpersonated_user\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdefault_access_mode\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/work/result.py\u001b[0m in \u001b[0;36m_run\u001b[0;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[1;32m    179\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_pull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    180\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_all\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 181\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_attach\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    182\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    183\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_pull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/work/result.py\u001b[0m in \u001b[0;36m_attach\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    299\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_exhausted\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    300\u001b[0m             \u001b[0;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_attached\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 301\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    302\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    303\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_buffer\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mn\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/io/_common.py\u001b[0m in \u001b[0;36minner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    176\u001b[0m             \u001b[0;32mdef\u001b[0m \u001b[0minner\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    177\u001b[0m                 \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 178\u001b[0;31m                     \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    179\u001b[0m                 \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mNeo4jError\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mServiceUnavailable\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mSessionExpired\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mexc\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    180\u001b[0m                     \u001b[0;32massert\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0masyncio\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0miscoroutinefunction\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__on_error\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/io/_bolt.py\u001b[0m in \u001b[0;36mfetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    845\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    846\u001b[0m         \u001b[0;31m# Receive exactly one message\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 847\u001b[0;31m         tag, fields = self.inbox.pop(\n\u001b[0m\u001b[1;32m    848\u001b[0m             \u001b[0mhydration_hooks\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mresponses\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydration_hooks\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    849\u001b[0m         )\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/io/_common.py\u001b[0m in \u001b[0;36mpop\u001b[0;34m(self, hydration_hooks)\u001b[0m\n\u001b[1;32m     70\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     71\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mpop\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhydration_hooks\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 72\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_buffer_one_chunk\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     73\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     74\u001b[0m             \u001b[0msize\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtag\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_unpacker\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munpack_structure_header\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/io/_common.py\u001b[0m in \u001b[0;36m_buffer_one_chunk\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m     49\u001b[0m                 \u001b[0;32mwhile\u001b[0m \u001b[0mchunk_size\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     50\u001b[0m                     \u001b[0;31m# Determine the chunk size and skip noop\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 51\u001b[0;31m                     \u001b[0mreceive_into_buffer\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_socket\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_buffer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     52\u001b[0m                     \u001b[0mchunk_size\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_buffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpop_u16\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     53\u001b[0m                     \u001b[0;32mif\u001b[0m \u001b[0mchunk_size\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_sync/io/_common.py\u001b[0m in \u001b[0;36mreceive_into_buffer\u001b[0;34m(sock, buffer, n_bytes)\u001b[0m\n\u001b[1;32m    324\u001b[0m     \u001b[0;32mwith\u001b[0m \u001b[0mmemoryview\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbuffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mview\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    325\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mused\u001b[0m \u001b[0;34m\u003c\u001b[0m \u001b[0mend\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 326\u001b[0;31m             \u001b[0mn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mview\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mbuffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mused\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0mend\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mend\u001b[0m \u001b[0;34m-\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mused\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    327\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mn\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    328\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mOSError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"No data\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_async_compat/network/_bolt_socket.py\u001b[0m in \u001b[0;36mrecv_into\u001b[0;34m(self, buffer, nbytes)\u001b[0m\n\u001b[1;32m    491\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    492\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnbytes\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 493\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_wait_for_io\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_socket\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnbytes\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    494\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    495\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0msendall\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.10/dist-packages/neo4j/_async_compat/network/_bolt_socket.py\u001b[0m in \u001b[0;36m_wait_for_io\u001b[0;34m(self, func, *args, **kwargs)\u001b[0m\n\u001b[1;32m    466\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_wait_for_io\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    467\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_deadline\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--\u003e 468\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    469\u001b[0m         \u001b[0mtimeout\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_socket\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgettimeout\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    470\u001b[0m         \u001b[0mdeadline_timeout\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_deadline\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mto_timeout\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mKeyboardInterrupt\u001b[0m: "]}],"source":["# Functions to create nodes and relationships in Neo4j\n","def create_graph(driver, df):\n","    # Open a session with the database\n","    with driver.session() as session:\n","        # Loop through the DataFrame rows\n","        for index, row in df.iterrows():\n","            # Create or merge Product node\n","            session.run(\n","                \"MERGE (p:Product {asin: $asin}) \"\n","                \"ON CREATE SET p.title = $title, p.average_rating = $average_rating, p.price = $price \",\n","                {'asin': row['parent_asin'], 'title': row['title'],\n","                 'average_rating': row['average_rating'], 'price': row['price']}\n","            )\n","\n","            # Create or merge User node\n","            session.run(\n","                \"MERGE (u:User {id: $user_id})\",\n","                {'user_id': row['user_id']}\n","            )\n","\n","            # Create PURCHASED relationship\n","            session.run(\n","                \"MATCH (u:User {id: $user_id})\"\n","                \"MATCH (p:Product {asin: $asin})\"\n","                \"MERGE (u)-[:PURCHASED {rating: $rating}]-\u003e(p)\",\n","                {'user_id': row['user_id'], 'asin': row['parent_asin'], 'rating': row['rating']}\n","            )\n","\n","            # Split categories and create BELONGS_TO relationships\n","            categories = row['categories'].split(', ')\n","            for category_name in categories:\n","                session.run(\n","                    \"MERGE (c:Category {name: $name})\",\n","                    {'name': category_name}\n","                )\n","                session.run(\n","                    \"MATCH (p:Product {asin: $asin})\"\n","                    \"MATCH (c:Category {name: $name})\"\n","                    \"MERGE (p)-[:BELONGS_TO]-\u003e(c)\",\n","                    {'asin': row['parent_asin'], 'name': category_name}\n","                )\n","\n","            # Create or merge Store node and SOLD_BY relationship\n","            session.run(\n","                \"MERGE (s:Store {name: $name})\",\n","                {'name': row['store']}\n","            )\n","            session.run(\n","                \"MATCH (p:Product {asin: $asin})\"\n","                \"MATCH (s:Store {name: $name})\"\n","                \"MERGE (p)-[:SOLD_BY]-\u003e(s)\",\n","                {'asin': row['parent_asin'], 'name': row['store']}\n","            )\n","\n","# Execute the graph creation\n","create_graph(driver, df)\n","\n","# Close the driver connection when done\n","driver.close()"]},{"cell_type":"code","execution_count":null,"id":"QsAlXJHYRDWL","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":600,"status":"ok","timestamp":1713046660229,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"QsAlXJHYRDWL","outputId":"ad755884-525b-44f4-e9a6-afd0e1481a12"},"outputs":[{"name":"stdout","output_type":"stream","text":["Successfully connected to Neo4j!\n"]}],"source":["from neo4j import GraphDatabase\n","import time\n","\n","uri = \"neo4j://8.tcp.ngrok.io:17322 -\u003e localhost:7687\"\n","username = \"neo4j\"\n","password = \"apan5400\"\n","\n","driver = GraphDatabase.driver(uri, auth=(username, password))\n","\n","def test_connection():\n","    retries = 5\n","    while retries \u003e 0:\n","        try:\n","            with driver.session() as session:\n","                session.run(\"RETURN 'Successfully connected to Neo4j!' AS greeting\").single()[0]\n","                print(\"Successfully connected to Neo4j!\")\n","                return\n","        except Exception as e:\n","            print(f\"Failed to connect to Neo4j: {e}, retrying in 5 seconds...\")\n","            time.sleep(5)\n","            retries -= 1\n","        finally:\n","            if retries == 0:\n","                print(\"All retries failed.\")\n","\n","# Test the connection\n","test_connection()\n","\n","\n"]},{"cell_type":"code","execution_count":null,"id":"JS50x3DxsZlI","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":207},"executionInfo":{"elapsed":223,"status":"error","timestamp":1713042188450,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"JS50x3DxsZlI","outputId":"b421c829-2f2b-430e-ee64-f6e793cd47d1"},"outputs":[{"ename":"NameError","evalue":"name 'users' is not defined","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)","\u001b[0;32m\u003cipython-input-56-cc084e92a1f0\u003e\u001b[0m in \u001b[0;36m\u003ccell line: 44\u003e\u001b[0;34m()\u001b[0m\n\u001b[1;32m     42\u001b[0m                         product_store)\n\u001b[1;32m     43\u001b[0m \u001b[0;31m# Execute the graph creation\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---\u003e 44\u001b[0;31m \u001b[0mcreate_graph\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdriver\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mproducts\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0musers\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcategories\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstores\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     45\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     46\u001b[0m \u001b[0;31m# Close the driver connection when done\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mNameError\u001b[0m: name 'users' is not defined"]}],"source":["#V2\n","# Function to create nodes and relationships in Neo4j\n","def create_graph(driver, products, users, categories, stores):\n","    with driver.session() as session:\n","        # Add Product nodes\n","        for product in products:\n","            session.run(\"MERGE (p:Product {asin: $asin}) \"\n","                        \"SET p.title = $title, p.average_rating = $average_rating, p.price = $price\",\n","                        product)\n","\n","        # Add User nodes\n","        for user in users:\n","            session.run(\"MERGE (u:User {user_id: $user_id})\", user)\n","\n","        # Add Category nodes\n","        for category in categories:\n","            session.run(\"MERGE (c:Category {name: $name})\", category)\n","\n","        # Add Store nodes\n","        for store in stores:\n","            session.run(\"MERGE (s:Store {name: $name})\", store)\n","\n","        # Add PURCHASED relationships\n","        for purchase in purchases:\n","            session.run(\"MATCH (u:User {user_id: $user_id})\"\n","                        \"MATCH (p:Product {asin: $asin})\"\n","                        \"MERGE (u)-[:PURCHASED {rating: $rating}]-\u003e(p)\",\n","                        purchase)\n","\n","        # Add BELONGS_TO relationships\n","        for product_category in product_categories:\n","            session.run(\"MATCH (p:Product {asin: $asin})\"\n","                        \"MATCH (c:Category {name: $category_name})\"\n","                        \"MERGE (p)-[:BELONGS_TO]-\u003e(c)\",\n","                        product_category)\n","\n","        # Add SOLD_BY relationships\n","        for product_store in product_stores:\n","            session.run(\"MATCH (p:Product {asin: $asin})\"\n","                        \"MATCH (s:Store {name: $store_name})\"\n","                        \"MERGE (p)-[:SOLD_BY]-\u003e(s)\",\n","                        product_store)\n","# Execute the graph creation\n","create_graph(driver, products, users, categories, stores)\n","\n","# Close the driver connection when done\n","driver.close()"]},{"cell_type":"code","execution_count":null,"id":"ipJy59gIWCrC","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1404,"status":"ok","timestamp":1713043463284,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"ipJy59gIWCrC","outputId":"e386e712-0bb0-4676-8399-dd5a457b5553"},"outputs":[{"name":"stdout","output_type":"stream","text":["No popular category found.\n","The most popular product is: Tyger Auto T1 Soft Roll Up Truck Bed Tonneau Cover Compatible with 2004-2012 Chevy Colorado / GMC Canyon; 2006-2008 Isuzu I280 | Fleetside 6'1\" Bed (72\") | TG-BC1C9002 with 1 purchases.\n"]}],"source":["from neo4j import GraphDatabase\n","\n","# Function to find the most popular category\n","def find_most_popular_category(driver):\n","    with driver.session() as session:\n","        result = session.run(\"\"\"\n","            MATCH (p:Product)-[:BELONGS_TO]-\u003e(c:Category)\u003c-[:PURCHASED]-(:User)\n","            RETURN c.name AS Category, COUNT(*) AS Purchases\n","            ORDER BY Purchases DESC\n","            LIMIT 1\n","        \"\"\")\n","        return result.single()\n","\n","# Function to find the most popular product\n","def find_most_popular_product(driver):\n","    with driver.session() as session:\n","        result = session.run(\"\"\"\n","            MATCH (p:Product)\u003c-[:PURCHASED]-(:User)\n","            RETURN p.title AS Product, COUNT(*) AS Purchases\n","            ORDER BY Purchases DESC\n","            LIMIT 1\n","        \"\"\")\n","        return result.single()\n","\n","# Connect to the Neo4j database\n","\n","uri = \"neo4j://8.tcp.ngrok.io:17322 -\u003e localhost:7687\"\n","username = \"neo4j\"\n","password = \"apan5400\"\n","driver = GraphDatabase.driver(uri, auth=(username, password))\n","\n","# Find and print the most popular category\n","most_popular_category = find_most_popular_category(driver)\n","if most_popular_category:\n","    print(f\"The most popular category is: {most_popular_category['Category']} with {most_popular_category['Purchases']} purchases.\")\n","else:\n","    print(\"No popular category found.\")\n","\n","# Find and print the most popular product\n","most_popular_product = find_most_popular_product(driver)\n","if most_popular_product:\n","    print(f\"The most popular product is: {most_popular_product['Product']} with {most_popular_product['Purchases']} purchases.\")\n","else:\n","    print(\"No popular product found.\")\n","\n","# Close the driver connection when done\n","driver.close()\n"]},{"cell_type":"code","execution_count":null,"id":"M8WAC_AZXdf0","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":647,"status":"ok","timestamp":1713043903934,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"M8WAC_AZXdf0","outputId":"8963f429-be9a-4a6b-bd29-fb84c77fbea1"},"outputs":[{"name":"stdout","output_type":"stream","text":["                                            Product1  \\\n","0  Walker Exhaust SoundFX 18963 Direct Fit Exhaus...   \n","1                                            perfect   \n","\n","                                            Product2  Frequency  \n","0  Walker Exhaust SoundFX 18962 Direct Fit Exhaus...          1  \n","1  AIP Electronics Premium Ignition Coil Pack Com...          1  \n"]}],"source":["# Function to find frequent pairs of products\n","def find_frequent_product_pairs(driver):\n","    query = \"\"\"\n","    MATCH (u:User)-[:PURCHASED]-\u003e(p1:Product)\n","    WITH u, p1\n","    MATCH (u)-[:PURCHASED]-\u003e(p2:Product)\n","    WHERE p1 \u003c\u003e p2 AND id(p1) \u003c id(p2)\n","    RETURN p1.title AS Product1, p2.title AS Product2, COUNT(*) AS Frequency\n","    ORDER BY Frequency DESC\n","    LIMIT 10\n","    \"\"\"\n","    with driver.session() as session:\n","        result = session.run(query)\n","        return pd.DataFrame([record.data() for record in result])\n","\n","\n","# Connect to the Neo4j database\n","uri = \"neo4j://8.tcp.ngrok.io:17322 -\u003e localhost:7687\"\n","username = \"neo4j\"\n","password = \"apan5400\"\n","driver = GraphDatabase.driver(uri, auth=(username, password))\n","\n","# Find frequent product pairs\n","frequent_pairs_df = find_frequent_product_pairs(driver)\n","print(frequent_pairs_df)\n","# Close the driver connection when done\n","driver.close()"]},{"cell_type":"code","execution_count":null,"id":"8pRG3oiMYdpl","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":647,"status":"ok","timestamp":1713044103574,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"8pRG3oiMYdpl","outputId":"56f5d2f6-fdc5-4bef-f373-23da47fdca8d"},"outputs":[{"name":"stdout","output_type":"stream","text":["Empty DataFrame\n","Columns: []\n","Index: []\n"]}],"source":["import pandas as pd\n","from neo4j import GraphDatabase\n","\n","# Function to find category trends\n","def find_category_trends(driver):\n","    query = \"\"\"\n","    MATCH (p:Product)-[:BELONGS_TO]-\u003e(c:Category)\u003c-[r:PURCHASED]-(u:User)\n","    WITH c.name AS Category, date(r.date) AS Date, COUNT(*) AS Purchases\n","    RETURN Category, Date, Purchases\n","    ORDER BY Category, Date\n","    \"\"\"\n","    with driver.session() as session:\n","        result = session.run(query)\n","        # Convert to DataFrame\n","        return pd.DataFrame([record.data() for record in result])\n","\n","# Connect to the Neo4j database\n","uri = \"neo4j://8.tcp.ngrok.io:17322 -\u003e localhost:7687\"\n","username = \"neo4j\"\n","password = \"apan5400\"\n","driver = GraphDatabase.driver(uri, auth=(username, password))\n","\n","# Get category trends\n","category_trends_df = find_category_trends(driver)\n","print(category_trends_df)\n","\n","# Close the driver connection when done\n","driver.close()"]},{"cell_type":"markdown","id":"dF8FQo_GF8u0","metadata":{"id":"dF8FQo_GF8u0"},"source":[]},{"cell_type":"code","execution_count":null,"id":"yPWatLScC_3V","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":115,"status":"ok","timestamp":1713042031975,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"yPWatLScC_3V","outputId":"0a81404b-4c17-4e58-fd6d-bd7e987f26a7"},"outputs":[{"name":"stdout","output_type":"stream","text":["Connection failed: Cannot connect to any known routers\n"]}],"source":["def check_connection():\n","    try:\n","        graph.run(\"RETURN 'Connection Successful'\").data()\n","    except Exception as e:\n","        print(f\"Connection failed: {e}\")\n","\n","check_connection()\n","\n"]},{"cell_type":"code","execution_count":null,"id":"wF1nXjGNAqAa","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1447,"status":"ok","timestamp":1712971999406,"user":{"displayName":"Geer Hong","userId":"17722549052590073175"},"user_tz":240},"id":"wF1nXjGNAqAa","outputId":"ffd8f6e5-e53f-415d-a7d0-f31f2bfaf0d1"},"outputs":[{"name":"stderr","output_type":"stream","text":["\u003cipython-input-70-11bb0769ea06\u003e:2: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n","  with driver.session() as session:\n"]},{"name":"stdout","output_type":"stream","text":["All Nodes and relationships are deleted!\n"]}],"source":["query = (\"MATCH (n) DETACH DELETE n\")\n","with driver.session() as session:\n","    session.run (query)\n","\n","print(\"All Nodes and relationships are deleted!\")"]},{"cell_type":"code","execution_count":null,"id":"CMDURAti80-4","metadata":{"id":"CMDURAti80-4"},"outputs":[],"source":["def create_connection(uri, user, password):\n","    return GraphDatabase.driver(uri, auth=(username, password))\n","driver = create_connection(uri, username, password)"]},{"cell_type":"markdown","id":"k0IrLvnQHIEk","metadata":{"id":"k0IrLvnQHIEk"},"source":[]},{"cell_type":"code","execution_count":null,"id":"bae6b1c6","metadata":{"id":"bae6b1c6"},"outputs":[],"source":["#The plan:\n","\n","#Product Nodes: Each product can be a node, with properties like title, average_rating, price, etc.\n","#User Nodes: Each user can also be a node, with a user_id property.\n","#Category Nodes: Categories can be nodes as well, with the category name as a property.\n","#Store Nodes: Stores are also nodes, with the store name as a property.\n","#PURCHASED Relationships: Connect User nodes to Product nodes to represent a purchase. The rating could be a property of this relationship.\n","#BELONGS_TO Relationship: Connect Product nodes to Category nodes to represent the categories each product belongs to.\n","#SOLD_BY Relationship: Connect Product nodes to Store nodes to represent the store selling the product."]}],"metadata":{"colab":{"name":"","version":""},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.11.5"}},"nbformat":4,"nbformat_minor":5}